const Asena = require('../events');
const {MessageType, MessageOptions, Mimetype} = require('@adiwajshing/baileys');
const axios = require('axios');

const Language = require('../language');
const Lang = Language.getString('wallpaper');

Asena.addCommand({pattern: 'help', fromMe: false, desc: Lang.WP}, (async (message, match) => {

    var r_text = new Array ();
    
    
    r_text[0] = "https://telegra.ph/file/24cacd9938446a38180fd.png";
    r_text[1] = "https://telegra.ph/file/24cacd9938446a38180fd.png";
    r_text[2] = "https://telegra.ph/file/24cacd9938446a38180fd.png";
    r_text[3] = "https://telegra.ph/file/24cacd9938446a38180fd.png";
    r_text[4] = "https://telegra.ph/file/24cacd9938446a38180fd.png";
    r_text[5] = "https://telegra.ph/file/24cacd9938446a38180fd.png";
    
        
     var i = Math.floor(6*Math.random())

    var respoimage = await axios.get(`${r_text[i]}`, { responseType: 'arraybuffer' })

    await message.sendMessage(Buffer(respoimage.data), MessageType.image, {mimetype: Mimetype.png, caption: `⛦━━━━━💮RAVANA💮━━━━━⛦


𝐇𝐞𝐥𝐥𝐨👋 𝐈 𝐚𝐦 𝐚 RAVANA🇱🇰 𝐛𝐨𝐭.
╚═════════════RAVANA(.)

■□■□■□■□■□■□■□■□■□■□
♕ *𝙈𝙚𝙙𝙞𝙖 𝘾𝙤𝙢𝙢𝙖𝙣𝙙𝙨* ♕

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .song <පෙළow>
🍙𝙐𝙨𝙚➜ ඔබ වෙනුවෙන් ගීතය බාගත කරයි..

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .video <yt link>
🍙𝙐𝙨𝙚➜ යූ ටියුබ් සබැඳියෙන් වීඩියෝ බාගන්න.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .profinsta<පරිශීලක නාමය>
🍙𝙐𝙨𝙚➜ පුද්ගලයාගේ පැතිකඩෙහි දැක්ව පෙන්වයි.
💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜  .insta <link>
🍙𝙐𝙨𝙚➜   Instagram වෙතින් අන්තර්ගතය බාගන්න.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜  .yt<text>
🍙𝙐𝙨𝙚➜   ඔබට yt සබැඳි ලබා දෙයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜  .show <පෙන්වන්න නම>
🍙𝙐𝙨𝙚➜   රූපවාහිනී කතා මාලාව හා සංදර්ශන සම්බන්ධ තොරතුරු ලබා ගන්න.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .gif 
🍙𝙐𝙨𝙚➜ වීඩියෝව gif බවට පරිවර්තනය කරයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .tomp3 
🍙𝙐𝙨𝙚➜ වීඩියෝව ශ්රව්ය උපකරණ බවට පරිවර්තනය කරයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .say <පෙළ>
🍙𝙐𝙨𝙚➜ පෙළ හ voice බවට පරිවර්තනය කරයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .img <පෙළ>
🍙𝙐𝙨𝙚➜ එය ගූගල් වෙතින් රූපය යවයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .trt <language code>
🍙𝙐𝙨𝙚➜ ඔබ ටැග් කරන පා text ය පරිවර්තනය කරන්න

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .wiki <පෙළ>
🍙𝙐𝙨𝙚➜ එය විකිපීඩියාවේ ප්රති .ලය යවයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .lyric <පෙළ>
🍙𝙐𝙨𝙚➜  ගීතයේ පද රචනා සොයා ගනී.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .covid <රටේ කේතය>
🍙𝙐𝙨𝙚➜ ඔබේ රටේ COVID සංඛ්යාලේඛන යවන්න.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .weather <නගරය>
🍙𝙐𝙨𝙚➜ ඔබේ ස්ථානයේ කාලගුණය ගැන ඔබට කියයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .removebg 
🍙𝙐𝙨𝙚➜ රූපයේ පසුබිම ඉවත් කරයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .ocr
🍙𝙐𝙨𝙚➜ රූපයේ ලියා ඇති පෙළ සොයා ගනී.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .wallpaper
🍙𝙐𝙨𝙚➜ එය අහඹු බිතුපත ඔබට යවයි.

■□■□■□■□■□■□■□■□■□■□
♟ *𝙁𝙪𝙣 𝘾𝙤𝙢𝙢𝙖𝙣𝙙𝙨* ♟

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .joke 
🍙𝙐𝙨𝙚➜ එය අහඹු විහිළුවක් යවයි.
 
💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .meme <පෙළ>
🍙𝙐𝙨𝙚➜ Cations the image into a meme.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .quote 
🍙𝙐𝙨𝙚➜ එය අහඹු උපුටා දැක්වීමක් යවයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .ss <වෙබ් අඩවි සබැඳිය>
🍙𝙐𝙨𝙚➜ එය වෙබ් අඩවියේ තිර රුව යවයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .changesay <පෙළ>
🍙𝙐𝙨𝙚➜ Text පෙළ වෙනස් කිරීමේ මතක රූපයක් බවට පරිවර්තනය කරයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .trumpsay
🍙𝙐𝙨𝙚➜ ට්‍රම්ප්ගේ ට්වීට් එකට පෙළ පරිවර්තනය කරන්න

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .compliment 
🍙𝙐𝙨𝙚➜ ඔබට ප්‍රශංසාවක් ලබා දෙයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜  .bitly <link>
🍙𝙐𝙨𝙚➜   ඔබේ සබැඳිය කෙටි කරන්න.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜  .dict 
🍙𝙐𝙨𝙚➜   ශබ්ද කෝෂය [-dict en; anime]

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜  .zodiac <leo> 
🍙𝙐𝙨𝙚➜   ඔබේ කේන්දර සටහන ගැන ඔබට කියයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜  .qr <text>
🍙𝙐𝙨𝙚➜   පෙළ qr කේතයක් බවට පරිවර්තනය කරයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜  .movie 
🍙𝙐𝙨𝙚➜  චිත්‍රපටය පිළිබඳ තොරතුරු ඔබට ලබා දෙයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜  .anime <text>
🍙𝙐𝙨𝙚➜  සජීවිකරණය පිළිබඳ තොරතුරු ඔබට ලබා දෙයි.
■□■□■□■□■□■□■□■□■□■□
♝ *𝙎𝙩𝙞𝙘𝙠𝙚𝙧 𝘾𝙤𝙢𝙢𝙖𝙣𝙙𝙨* ♝

සමහර ලොගෝ වැඩ නෑ මොකද ලොගෝ දෙන site එක limit තියෙන්නේ unlimited ගන්නනම් සල්ලි  ඕන.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .sticker 
🍙𝙐𝙨𝙚➜ img / gif ස්ටිකරයක් බවට පරිවර්තනය කරයි.


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .photo 
🍙𝙐𝙨𝙚➜ ස්ටිකර් රූපයට පරිවර්තනය කරයි.

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .attp <text>
🍙𝙐𝙨𝙚➜ Text පෙළ දිලිසෙන ස්ටිකරයක් බවට පරිවර්තනය කරයි.
■□■□■□■□■□■□■□■□■□■□
💢Logo  Commands💢

💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .txttiomg
🍙𝙐𝙨𝙚➜ Logo ලාංඡන විධාන ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rwolf<පෙළ>
🍙𝙐𝙨𝙚➜ වෘකයාගේ ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rlight<පෙළ>
🍙𝙐𝙨𝙚➜ Light සැහැල්ලු ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rff<පෙළ> 
🍙𝙐𝙨𝙚➜ free fire ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rlogo<පෙළ>
🍙𝙐𝙨𝙚➜ ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rphlogo<පෙළ>
🍙𝙐𝙨𝙚➜ ph ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rcoding<පෙළ>
🍙𝙐𝙨𝙚➜ කේතීකරණ ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rbreakwall<පෙළ>
🍙𝙐𝙨𝙚➜ බ්‍රේක්වෝල් ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .raveng<පෙළ>
🍙𝙐𝙨𝙚➜ aveng ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rpark<පෙළ>
🍙𝙐𝙨𝙚➜ park ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rsplay<පෙළ>
🍙𝙐𝙨𝙚➜ youtube silver play button ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rgplay<පෙළ>
🍙𝙐𝙨𝙚➜ youtube gold play button ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rbook<පෙළ>
🍙𝙐𝙨𝙚➜ පොතක නම වැටෙන ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rdropwater<පෙළ>
🍙𝙐𝙨𝙚➜ dropwater ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rbneon<පෙළ>
🍙𝙐𝙨𝙚➜ bneon ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rgtext<පෙළ>
🍙𝙐𝙨𝙚➜ tiktok ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .repep<පෙළ>
🍙𝙐𝙨𝙚➜ free fire ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rsandw<පෙළ>
🍙𝙐𝙨𝙚➜ මුහුදු වෙරලක ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rcl<පෙළ>
🍙𝙐𝙨𝙚➜  ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rflame<පෙළ>
🍙𝙐𝙨𝙚➜ flame ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rht<පෙළ>
🍙𝙐𝙨𝙚➜ ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rlt<පෙළ>
🍙𝙐𝙨𝙚➜light text ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rmarval<පෙළ>
🍙𝙐𝙨𝙚➜ marval studio ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rsilk<පෙළ>
🍙𝙐𝙨𝙚➜ silk රෙද්ද්ක නම වැටෙන ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rsn<පෙළ>
🍙𝙐𝙨𝙚➜ snow ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rpubg<පෙළ>
🍙𝙐𝙨𝙚➜ pubg ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rnaruto<පෙළ>
🍙𝙐𝙨𝙚➜ naruto ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rlion<පෙළ>
🍙𝙐𝙨𝙚➜ lion ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rtoxic<පෙළ>
🍙𝙐𝙨𝙚➜ toxic ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rwg<පෙළ>
🍙𝙐𝙨𝙚➜  ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rhorror<පෙළ>
🍙𝙐𝙨𝙚➜ horror blood ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rst<පෙළ>
🍙𝙐𝙨𝙚➜ stoberry ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rspace<පෙළ>
🍙𝙐𝙨𝙚➜ space ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rneonx<පෙළ>
🍙𝙐𝙨𝙚➜ neon ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rgalaxy<පෙළ>
🍙𝙐𝙨𝙚➜ galaxy ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rbokeh<පෙළ>
🍙𝙐𝙨𝙚➜ bokeh ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rpaper<පෙළ>
🍙𝙐𝙨𝙚➜ paper in grass ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rdneon<පෙළ>
🍙𝙐𝙨𝙚➜ dark neon ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rcc2<පෙළ>
🍙𝙐𝙨𝙚➜ cofee cup 2 ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rharry<පෙළ>
🍙𝙐𝙨𝙚➜ harry potter ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .ruwo<පෙළ>
🍙𝙐𝙨𝙚➜ under woter ocean ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rwood<පෙළ>
🍙𝙐𝙨𝙚➜ wood ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rwood<පෙළ>
🍙𝙐𝙨𝙚➜ wood ලාංඡනය ලබා ගන්න


💮𝘾𝙤𝙢𝙢𝙖𝙣𝙙➜ .rcandy<පෙළ>
🍙𝙐𝙨𝙚➜ candy ලාංඡනය ලබා ගන්න


සමහර ලොගෝ වැඩ නෑ මොකද ලොගෝ දෙන site එක limit තියෙන්නේ unlimited ගන්නනම් සල්ලි  ඕන.
┇
┇ ᵐᵒʳᵉ ˡᵒᵍᵒˢ ᶜᵒᵐᵐⁱⁿᵍ ˢᵒᵒⁿ😉
┇_______________________________
┇ try more logos type :-)
┇              *!txttoimg*
╚═══════════════════════════════

═════💢RAVANA💢═════
▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣▣

`}) 

}));
